[{
    "model": "care.care",
    "pk": 1,
    "fields": {
        "name": "Bearded Dragon",
        "category": 2,
        "animal": 2,
        "care_guide": "Anyone with a bearded dragon will tell you… caring for them properly is hardly as common sense as it is with a dog or cat. From very specific lighting and temperature requirements, to bizarre behavior (AKA glass surfing and head bobbing), and strict dietary needs, it’s no wonder so many first time owners find themselves stressed out with a sick or unhappy new pet! Luckily, I’ve decided to put together a comprehensive Bearded Dragon Care Guide for Beginners that should take at least some of the stress out of caring for your new little guy or gal. So, if you’d like to gain a better understanding of how to care for a bearded dragon… simply keep reading!",
        "cage_setup": "While a hatchling dragon could live in a 20-gallon aquarium for a short time, it will quickly need a larger enclosure. A 75-gallon aquarium or equal-sized enclosure is OK for an adult dragon. Screening should be used for proper ventilation, whether as a top on an aquarium enclosure or in the construction of a custom enclosure. During warm weather bearded dragons can be kept in outdoor cages. Be sure the outdoor enclosure provides both sunny basking areas and shady retreats, as well as shelter from rain. Having access to the sun outdoors provides healthy UV. Bearded dragons like to climb, so some sturdy branches are welcome in their enclosures.",
        "lighting": "In addition to the basking spotlight, provide full-spectrum UVB (ultraviolet) lighting over the rest of the enclosure. This lighting is critically important for dragons that are kept indoors, as it assists them in synthesizing vitamin D3, which aids in calcium absorption. There are many types of lights available; consult with store employees and read the packaging to determine the best for your setup.",
        "heating": "Bearded dragons like it hot. A basking site of about 40 degrees Celsius works well for them. The basking site can be provided by a spotlight positioned over a rock, branch, etc. at one end of the enclosure. Keeping the spotlight at one end of the cage will allow your dragon to thermoregulate (move between a cooler end of the enclosure and the hotter end with the basking area). The cooler end of the enclosure can be kept at about 30 degrees.",
        "feeding_schedule": "Bearded dragons are omnivorous, meaning they eat both animal and plant matter. They are not usually picky and eat with gusto. Insects, such as crickets and mealworms, should be dusted with a vitamin/mineral supplement and calcium. Dusting can be achieved by placing the insects in a plastic bag with some of the powder, and shaking the bag to lightly coat the insects prior to offering them to your lizards. Also offer bearded dragons finely chopped veggies (such as romaine lettuce, zucchini, carrots, etc.), greens (collard, mustard, dandelion, etc.) and fruit (kiwi, banana, mango, etc.). Use healthy, vitamin-rich items; sprinkle the appropriate amount of powdered supplements on these foods, too. Avoid iceberg lettuce because it is not nutritious. You can also feed commercially available foods from the major reptile product manufacturers as well. These foods are formulated specifically for the bearded dragon and can be a great addition to the fresh foods that your bearded dragon eats every day. Bearded dragons will also eat pinky mice, and a wide variety of nutritionally balanced manufactured diets are available at pet stores, too. Again, if you keep your dragons on sand, offer food on a shallow dish rather than placing it directly on the substrate.",
        "known_problems": "Metabolic bone disease is a bone condition that results from a lack of calcium in the blood. Always replace your monitor’s UVB bulb every six months and make sure its diet is high in calcium. Poor nutrition and a lack of UVB light leads to low calcium, which in turn triggers the release of calcium from the bone. This results in soft bones that fracture easily.",
        "other_information": "https://www.reptilesmagazine.com/bearded-dragon-care-sheet/",
        "other_information_name": "Reptiles Magazine"
    }
}, {
    "model": "care.care",
    "pk": 2,
    "fields": {
        "name": "Ball Python",
        "category": 1,
        "animal": 1,
        "care_guide": "Always have fresh, clean water available for your ball python. Check the water daily. The size of the water dish is up to you. If it is large enough for the ball python to crawl in to and soak, sooner or later your snake will make the most of the opportunity – ball pythons seem to enjoy a nice soak from time to time. Ensure that the water bowl is not too deep for juvenile animals – 1 inch or so will suffice. Snakes of many species will defecate in their water bowls from time to time, so be prepared to clean and disinfect the water bowl. The water bowl should be cleaned and disinfected on a weekly basis. Having a spare water bowl for such occasions can be handy, so that one may be used while the other is being cleaned. Ball pythons are generally shy and will spend much of their time hiding. Your ball python may initially see you as a threat and it must learn who you are. The goal is to establish trust between you and your snake. Always support your ball python’s body and avoid fast movements. Once a ball python realizes that you will not hurt it they often seem to enjoy being handled. Some ball pythons may try to hide when handled and occasionally there are ones that may even bite due to excessive fear. These ball pythons may require a bit more time to settle in and establish trust. A ball python’s bite is a superficial wound. If a snake looks like it is going to strike, it is best to not handle it. Relax when holding your animal – sit down and give the animal a chance to settle.",
        "cage_setup": "Newspapers and paper towels are the cheapest and easiest substrates for ball pythons with regards to cleaning and disinfecting – out with the old, in with the new. Cypress mulch and orchid bark are great substrates for controlling humidity, but remember that too much humidity can be as detrimental (if not more) as too little. Never use any substrate containing cedar, as it contains oils that can be deadly to reptiles! Avoid sand, shavings and peat bedding. The ideal Ball Python setup is one with plenty of hiding spaces and cover for the snake to feel secure. Because of the humidity requirements bio-active setups are perfect for this species. Make sure to have at least one hiding spot such as a cave on either end of the enclosure as to provide the snake the opportunity to regulate its temperature. A humid hide is also highly recommended as this will allow the snake to temporarily increase its humidity and help with shedding issues.",
        "lighting": "12 hours a day of normal light is recommended. As this species is nocturnal a basking lamp is not required. Special UVB lamps are not required but may be beneficial.",
        "heating": "As Ball Pythons are nocturnal, we recommend under tank heating such as heat mats or heat cable connected to a thermostat. The thermostat will ensure the correct temperature is always maintained.",
        "feeding_schedule": "Feed adult ball pythons every 1 to 2 weeks and younger ball pythons weekly as they need this energy to grow. Do not be alarmed if a well-started ball python goes off feed during the cooler, drier times of the year, as this is common in captivity. Snakes generally do not eat while they are in the shed cycle.",
        "known_problems": "Some snakes may not eat for several hours or longer after being handled, so avoid handling if you plan to feed. After a snake has eaten it may be a good idea to limit the handling because it may be uncomfortable for the animal. Avoid putting your snake’s cage in a heavy traffic area, excessive movement, and other pets should be avoided. Ball pythons are well-known for not eating at certain times throughout the year, particularly in the winter months. Be prepared for the possibility of your ball python going off feed, and keep an observant eye on the snake’s overall condition and body weight. This is typically nothing to worry about with healthy, well-established pythons, although it can be extremely frustrating to the snake keeper. If your ball python is healthy, continue your husbandry routine as usual, but keep the amount of handling to a minimum. Offer your ball python food every 10 to 14 days until it is interested in eating again, as the snake will eventually resume feeding normally.",
        "other_information": "https://www.reptilesmagazine.com/ball-python-care-sheet/",
        "other_information_name": "Reptiles Magazine"
    }
}, {
    "model": "care.care",
    "pk": 3,
    "fields": {
        "name": "Red Eyed Tree Frog",
        "category": 3,
        "animal": 3,
        "care_guide": "Red eyed tree frogs generally live in lowland rainforests that are close to some kind of water course (river, lake, etc.).  As a “arboreal amphibian,” the red-eyed tree frog tends to dwell in trees and tall leafy plants. \r\n\r\nThey spend much of the tadpole stage of their life in the water, only migrating to the trees as they age and mature.",
        "cage_setup": "Red eyed tree frogs are pretty small – as a result, people tend to cram them into enclosures that are way too small for their needs.\r\n\r\nAt minimum, one adult tree frog should be kept in a terrarium at least 15-20 gallons in size.\r\n\r\nSince red eyed tree frogs naturally live in rain forest canopies, they prefer a habitat that has more height than width.\r\n\r\nOur habitat of choice for red eyed tree frogs is the 18 x 18 x 24 Exo Terra Terrarium. It offers great height (which tree frogs love) and is actually large enough to house a second red eyed tree frog (in case you want to get your frog a friend in the future).\r\n\r\nIf you want to go with a cheaper option, 40 gallon breeder tanks can usually be found for pretty cheap at Petsmart (during their $1 per gallon sales) and can house 3-4 frogs.",
        "lighting": "A lot of red eyed tree frog owners have recently started advocating the use of UVB bulbs in their frog enclosures.\r\n\r\nUVB is important for tree frogs because it helps with the synthesis of Vitamin D3 (with is responsible for calcium absorption). Without UVB light, tree frogs are susceptible to Metabolic Bone Disease.\r\n\r\nThe best UVB light for red eyes tree frogs is the Zoo Med ReptiSun 5.0 T5. Tree frogs don’t need a ton of UVB light, so even a small bulb should work just fine. Also, make sure to provide them with a lot of shade.",
        "heating": "In addition to a UVB bulb, you’ll also want to add some sort of “heat” lamp to one side of the terrarium for additional warmth (I say “heat” because red eyed tree frogs really don’t like it too warm or bright).\r\n\r\nA 6500K LED bulb is perfect for red eyed tree frogs and will also help a ton if you plan to keep live plants.\r\n\r\nIf the ambient temperature in you red eyed tree frog’s enclosure fall below the optimal levels which we will discuss in the next section), you may want to invest in a ceramic heat emitter.\r\n\r\nCHEs heat your tank without the use of any visible light, so they’re perfect for daytime and nighttime use alike (since they don’t upset your frog’s sleeping patterns).",
        "feeding_schedule": "Insects make up the vast majority of the red eyed tree frog’s diet. Here are a few types of insect that work well for regular feeders:\r\n\r\nCrickets (main staple)\r\nSilkworms (occasionally)\r\nHornworms (occasionally)\r\nDubia Roaches (occasionally)\r\n\r\nBefore feeding time, give your crickets a light mist with a spray gun. Next, place them in small plastic/paper bag and sprinkle some calcium powder on top. Shake the bag around (gently) until the crickets look adequately coated.\r\n\r\nAnother way of introducing calcium into your frog’s diet is by gut-loading crickets with the calcium/multivitamin powder.\r\n\r\nSimply sprinkle some power on whatever you decide to feed your crickets (veggies, salad, etc) and then feed them to your frog.",
        "known_problems": "Tree frogs stay hydrated by drinking and absorbing moisture through their skin. The best way to keep your frog hydrated is by keeping a large, shallow water dish in their habitat. The dish should be wide enough that your frog can fit inside comfortably.\r\n\r\nIn addition, the water should be shallow enough that your tree frog can rest inside comfortably without having to swim.\r\n\r\nA good rule of thumb is that the water should be no higher than the frog’s mouth when resting.\r\n\r\nThe water dish should be washed and refilled on a daily basis.\r\n\r\nIt is also very important that you only use dechlorinated water in your tree frog habitat – both for the water bowl and for mistings.",
        "other_information": "https://www.reptileadvisor.com/red-eyed-tree-frog-care/",
        "other_information_name": "Reptile Advisor"
    }
}, {
    "model": "care.care",
    "pk": 4,
    "fields": {
        "name": "Western Hognose Snake",
        "category": 1,
        "animal": 4,
        "care_guide": "The Western hognose is a docile, easy-to-handle snake. While individuals may exhibit spectacular bluffing displays as mentioned previously, these are not signs of aggression. Do not bother a snake that is exhibiting bluffing behavior, so as not to cause it undue stress. Wait until the snake has calmed down, and then handle it.\r\n\r\nWestern hognose bites are very rare, and typically occur due to a snake’s overeager feeding response. Some snakes will gently take food off hemostats, or they may prefer having food left in a quiet corner of the enclosure to eat at their leisure. Others will emerge from their enclosures ready for food with mouths open. No matter which type of behavior your animal displays, use hemostats, tongs or forceps to reduce the chance of an accidental bite.",
        "cage_setup": "A Western hognose does require a secure cage, even though it is not as adept at escape as other snakes. A plastic, 5-gallon reptile terrarium with a secure lid is ideal for a hatchling. These are inexpensive and widely available at most pet stores or reptile shops online that sell reptile supplies. An adult Western hognose can be kept in a 20-gallon aquarium set up. The Western hognose is a ground-dwelling species, so opt for an enclosure with a greater amount of floor space; height is not as important.\r\n\r\nIf housing several specimens, it can be more economical to use large, clear, plastic shoe or sweater boxes, the size of which depends on the size of the animals. I normally use three different sizes: 5-liter boxes for established hatchlings, 30-quart boxes for adult males and 40-quart boxes for adult females. Shoe and sweater boxes should have ample ventilation, especially in more humid regions, which can be achieved by drilling holes into them.\r\n\r\nI recommend keeping the cage furniture simple.  A sturdy water bowl and a hide box or two will suffice.",
        "lighting": "For these diurnal snakes, full-spectrum lighting should be provided 14 to 16 hours per day during the spring and summer and eight to 10 hours during the autumn. There are a range of full-spectrum lighting products available at local pet retail outlets that will fulfill the requirements of your Western hognose, including the Zoo Med Repticare Day Night Reptile Timer to measure the photoperiod.",
        "heating": "Under-tank heaters are available at pet stores and are specifically designed for use with most types of aquariums, such as the Zilla Heat Pad. One of these can be used to provide a hot spot basking area maintained at about 90 degrees Fahrenheit for your Western hognose. Be sure to get an appropriately sized heater to allow for a heat gradient—you don’t want it to heat more than one-third of the enclosure, so the snake can get away from the heat if desired—and never use medical heat pads found in pharmacies. While these may be adjustable, they can be potential fire hazards, or overheat the enclosure. Hot rocks are also to be avoided. The cooler end of the enclosure can be maintained in the high 70s. Keep this heat pad regulated with the Zilla Heat Habitat Thermostat Controller.\r\n\r\nMany Western hognose breeders house many snakes in rack systems. In a rack set-up, heat tape and a programmable thermostat or rheostat combination is most commonly used to provide heat. These can be purchased from reptile specialty stores or online. Heat tape is normally affixed to the shelving the enclosure sits on or in, and is a very good and easily manageable method for heating the enclosures in a rack.",
        "feeding_schedule": "Established Western hognoses are usually eager feeders; some will come at you with open mouths appearing to say, “Feed me!” For stocky snakes, Western hognoses can be quick, and they often don’t follow the standard practice of striking at prey head-on—they will strike at food items from any direction. For these reasons, it’s best to use tongs, forceps or hemostats when feeding Western hognoses.\r\n\r\nIt is best to feed an appropriately sized meal—meaning a prey item that’s about the same diameter as the snake’s head—one to two times per week. Once it has been swallowed it should produce a noticeable lump, but not one that is so large that it is still noticeable 24 hours later. In the wild, Western hognoses consume a variety of prey items, including small rodents, lizards, amphibians and the eggs of ground-nesting animals. Pets do very well on a diet of pre-killed or frozen/thawed mice. Many Western hognose keepers prefer frozen/thawed rodents because they are easier for the snake to digest; at the cellular level, the food item has been broken down by about half. Also, as with pre-killed mice, the risk of your Western hognose being injured by a live mouse is eliminated.",
        "known_problems": "Some hatchling Western hognoses can be challenging to get to accept mice. Scenting a thawed pinky mouse with canned tuna or salmon juice is easy and may encourage these snakes to eat. It usually gets good results, and it’s easy to wean the snakes off this form of scenting in a very short time. Sometimes “braining” a pinky works well, too, although this is not for the squeamish. It involves making a small pinhole in the skull of a frozen/thawed pinky, and squeezing a bit of brain matter out to smear on the mouse’s nose.\r\n\r\nIt is not recommended that toads be used as a scenting medium for Western hognoses. Using toads can introduce dangerous parasites to the snake, and it can also be difficult to wean small Western hognoses off toad-scented mice. Finding toads throughout the year can present problems, too.",
        "other_information": "https://www.reptilesmagazine.com/western-hognose-snake-care-sheet/",
        "other_information_name": "Reptiles Magazine"
    }
}, {
    "model": "care.care",
    "pk": 5,
    "fields": {
        "name": "Kenyan Sand Boa",
        "category": 1,
        "animal": 5,
        "care_guide": "The Kenyan sand boa is appealing to many keepers because of its minimal space requirements. Even the largest female Kenyan sand boa can be comfortably housed in a 10-gallon reptile terrarium with a secure lid, or a similarly sized enclosure. A plastic storage container of appropriate dimensions, along with air holes, will also work well in a heated shelving unit. The shelves must be tightly fitted with little room above the top of the individual container, because Kenyan sand boas can easily push the lid off of a plastic container. For reptile terrariums, you can use Zilla cage clips and locks to prevent escape.",
        "cage_setup": "Given the Kenyan sand boa’s propensity for burrowing, habitat accessories should be minimal. Heavy rocks should be avoided, unless they are firmly fastened to the enclosure. If a Kenyan sand boa burrows beneath heavy rocks and causes a mini-avalanche, the result could be injury or even death to the snake. Despite its small size, the Kenyan sand boa can be very destructive to your cage’s interior design, so décor does not need to be excessive.",
        "lighting": "An incandescent bulb with a 12 hour day/night cycle should be used.",
        "heating": "If a terrarium with a screen lid is used for the Kenyan sand boa, I advise using an undertank heating pad under one side of the cage (like the Zilla heat mat), left on 24/7, along with an incandescent overhead lamp fixture during the day, to heat the air in the cage. The hotspot under the light should be approximately 95 degrees Fahrenheit and the cooler side of the enclosure should be around 80 degrees. A drop to the mid-70s at night is acceptable. This can be measured using reptile thermometers.",
        "feeding_schedule": "The Kenyan sand boa has a strong appetite for live reptile food, specifically mice. Baby Kenyan sand boas typically prefer live pinky mice to get started, but with maturity, they almost always switch to frozen/thawed prey. Even with dead food, the prey is usually constricted. I use 12-inch metal tweezers to offer thawed mice to my snakes.\r\n\r\nAdult male Kenyan sand boas will accept a large hopper mouse, and an adult female Kenyan sand boa can handle a jumbo-sized mouse. Males tend to eat less frequently than females, although there are always exceptions. Some of my males will eat every chance they get.\r\n\r\nI offer food to the female Kenyan sand boas every week and to the males every 10 to 14 days. Kenyan sand boas that are shedding will often strike and constrict their meal, but then abandon it. For this reason, I do not offer food to Kenyan sand boas during their shed cycle.\r\n\r\nA sturdy ceramic bowl, like the Petrageous dish, is a good choice as a water dish for a Kenyan sand boa. A light plastic water dish will be easily pushed over, possibly fouling the environment. The only time the cage should have high humidity is during the Kenyan sand boa’s shed cycle. High humidity is important during the shed cycle to ensure all of the skin comes off safely. A humid hide box is rarely utilized, so I prefer to use a good old-fashioned spray bottle. It’s also a lot easier to increase the humidity in a plastic bin than it is in an open-air environment, such as a terrarium with a screen lid. You can measure the humidity with reptile hygrometers.",
        "known_problems": "As this is a desert species, the Kenyan sand boa is prone to shedding issues. Make sure to soak your sand boa during its shed cycles for 10 - 15 min in warm water to ensure proper hydration.",
        "other_information": "https://www.reptilesmagazine.com/kenyan-sand-boa-care-sheet/",
        "other_information_name": "Reptiles Magazine"
    }
}, {
    "model": "care.care",
    "pk": 6,
    "fields": {
        "name": "Boa Constrictor",
        "category": 1,
        "animal": 6,
        "care_guide": "The Colombian boa constrictor is the most widely kept boa constrictor in the pet industry (there are nine accepted subspecies of Boa constrictor, and many localities of some subspecies). Other common names include the common boa and red-tailed boa, although the true red-tailed boa is Boa constrictor constrictor, which is larger and found in countries including Suriname, Guyana, Peru and Brazil. There may be B. c. constrictor in southeastern Colombia, but these are rarely seen in the reptile world. Colombian boas have become popular due to being docile and having more “personality,” in that they seem to be more curious about their surroundings than some other snakes. Colombian boa constrictors make great pets, and they are available in a vast array of appealing color and pattern morphs. Proper care can be provided even by beginner hobbyists, but due to their potentially large size and lengthy life span, boas are best suited for moderate- and advanced-level keepers. With reptile health and wellness prioritized, this care sheet should help ensure quality keeping of the Colombian Boa Constrictor.",
        "cage_setup": "Young boa constrictors have simple needs; a large, beautifully decorated cage is not the best choice for them. While a new boa is acclimating, simple housing is preferred, and the enclosure should be prepared prior to your new boa’s arrival home. An appropriate first cage for a baby boa would be no larger than 30 inches long by 12 inches wide, in which it will feel very secure.\r\n\r\nNaturally, as the young boa grows, a larger cage will be required. Boa constrictors are terrestrial and floor space is more important than height. Young boas may climb, but do so much less as they grow. Typical full-grown adult boas should be housed in cages no smaller than 4 feet long by 2 feet wide (with larger-than-average snakes in larger enclosures).\r\n\r\nA hide box/shelter should be provided, which will allow the boa to feel safe and secure. There are many commercially manufactured types available for snake habitat products. The Zilla Habba Hut is one good option for reptile hides. Offer two hides, one on the warm side of the enclosure and one on the cool side. A stressed baby boa may stay on one side of the cage if only one hide is provided, which may discourage the snake from thermoregulating properly.\r\n\r\nYou may also provide rocks, sticks or other structures, but be sure they are positioned securely and free of parasites. A variety of reptile habitat accessories are available at stores or online.",
        "lighting": "Overhead lighting is not usually needed. If an overhead bulb is used, it should be placed directly over the source of the belly heat. Be sure to check the temperature of your hot spot while the bulb is on. If the belly heat being provided from the under-enclosure device is not warm enough, overhead lighting will assist in maintaining a proper hot spot, but overhead lighting or an overhead heating device alone is not recommended for boas.\r\n\r\nA low-wattage fluorescent bulb, such as the Exo Terra natural daylight reptile lamp, can be used to provide a photoperiod (day/night cycle) and to better observe your boa. Full-spectrum bulbs with UVB like the Solar Glo all in one reptile lamp, may provide physical and physiological benefits to boas, but this has not been proven. UVB lighting is not needed for the proper care of boas, and the vast majority of boa keepers do not use it. Still, it won’t harm your boa, so feel free to provide it just in case there is some benefit.",
        "heating": "Boas control their body temperature through thermoregulation, and the cage should have a warm side and a cool side. This is very important! Do not place the heat source in the center of the cage, place it at one end. Then if the boa gets too warm, it will move toward the cooler side, and if it is too cool, it will move to the warmer side. That’s thermoregulation!\r\n\r\nThe temperatures in the cool end your boa cage should not drop below 75 degrees Fahrenheit. The warm side should be 85 degrees, with a hot spot of 90 degrees provided by an under-cage heating device that will provide “belly heat.” Boa constrictors greatly prefer this, so they can coil over the rising heat.\r\n\r\nBelly heat can be provided using various devices. Under-tank heaters are the most readily available, such as a Zilla heat pad. Heat cable and heat tape are other possibilities. Any heating device should be controlled with a proportional thermostat or rheostat, such as the Zilla heat and temperature controller. Some heat sources, especially heat tape, can get too hot for some enclosures, and they must be regulated not just for the boa’s safety, but yours, too. If using these devices, especially if you’re using a glass enclosure such as an aquarium, be sure some ventilation is provided around the heat source. If heat builds up, it can crack the bottom of a glass tank, or cause other caging materials to melt or overheat.",
        "feeding_schedule": "It is very important to allow your new boa to acclimate to its new surroundings before feeding. Never attempt to feed a new boa for at least five days after you bring it home. I assure you your new boa will be fine without food during this time. If you feed it too soon, while it may still be stressed from the move to your home, the snake may regurgitate. If this occurs, be sure your temperatures are correct, and do not attempt to feed the boa again for two weeks. The most common causes of regurgitation are improper temperature and stress from being handled, so be sure you provide proper cage temperatures and do not excessively handle boas after meals.\r\n\r\nNever feed a new boa constrictor a meal that is larger than the snake’s mid-body girth. It should never exhibit a bulge after eating. Especially in young boas, a meal that is too large may lead to regurgitation. An established boa will handle a meal resulting in a small bulge just fine.\r\n\r\nPet boa constrictors should be fed only quality mice or rats. They need no additional food or supplementation. Be sure you buy your rodents from a good source to prevent disease and mites. Boas 2 years old and younger should be fed one appropriately sized rodent every seven to 10 days. Excessive feeding may lead to regurgitation, improper growth, and even premature death. Once boas near adulthood, they will thrive while being fed every 10 to 14 days. It is okay to feed your boa more or less often, but be sure to monitor weight so the boa does not become obese or underweight.\r\n\r\nMost boa constrictors available as pets will be eating frozen/thawed prey. If you purchase one that is eating live rodents, it will often take frozen/thawed prey that is presented from a pair of tongs. Pre-killed rodents are always best, whether they are frozen/thawed or freshly killed, because live rodents may harm your boa. If your snake does not kill its prey (boas will not eat if they are not hungry or are kept under improper conditions), the rodent may bite or even kill your boa. Even if the boa does constrict its prey, the rodent may bite before it is killed. Never leave your boa unattended with live rodents.",
        "known_problems": "Shedding issues are usually a result of insufficient humidity. A soak or two during the shed cycle will greatly help if you are experiencing low-humidity issues. Place a quarter-inch of warm water in an appropriately sized plastic container, and place your boa inside with a secure lid in place. Then place the container in your boa’s cage, positioned so the inside of the container has a warm side and cool side. This will keep the water warm and the humidity high. Do not place it directly over the belly heat or under a basking bulb. A few holes in the lid or sides of the container will provide ventilation. Soak your boa in the container for up to an hour (two hours if you’re combating a particularly tough shed) and repeat as necessary. Be sure to check on your boa regularly, as they will often defecate while soaking. Change the water and clean the container if this occurs. At end of the shed cycle, remove the water and place a small towel in the container so your boa can rub on it to help shed its old skin.",
        "other_information": "https://www.reptilesmagazine.com/colombian-boa-constrictor-care-sheet/",
        "other_information_name": "Reptiles Magazine"
    }
}, {
    "model": "care.care",
    "pk": 7,
    "fields": {
        "name": "Garter snake",
        "category": 1,
        "animal": 7,
        "care_guide": "he average life span in the wild may only be 4-5 years however they can live twice as long in captivity. Captives reaching over 10 years old have been documented when reptile health and wellness is prioritized along with proper snake supplies, reptile cleaning supplies, and snake habitat products.",
        "cage_setup": "Garters can be kept in rack systems, but are best suited for aquarium or reptile terrarium style cages. Acrylic or screen style terrariums make ideal cages and can be decorated reptile habitat accessories like wood and vines for the snake to climb around on, which provides beneficial exercise. Minimum size for and adult is a 28 quart plastic tube or a 29 gallon aquarium/terrarium. Males could be kept in slightly smaller cages than females due to their size difference. Multiple garter snakes can be kept together with more space however they should be separated for feeding to avoid incidental cannibalism. A pair of garter snakes can live comfortably in a 55 gallon size. The more space the better as garters are very active and like to climb.",
        "lighting": "While UV light may not be considered necessary it can be beneficial as garter snakes are active during the day in the wild using a Zoo Med ReptiSun 10.0 UVB Compact Fluorescent Reptile Lamp with the Zoo Med Repticare Day Night Timer. If UV light is not provided it is recommended to occasionally dust food items with a calcium/vitamin powder that contains D3, such as Zoo Med Repti Calcium with D3 Supplement.",
        "heating": "Garter snakes need a basking area between 90-95 degrees for proper digestion. Heat can be provided by either a basking lamp, heat tape (or Zilla Heat Mat) under the tank or both. As with any reptile a temperature gradient should occur in the cage with hides on both the hot and cool sides monitored by a Zilla Terrarium Heat & Habitat Lighting Controller. It is important to maintain moderate humidity for proper shedding however the cage should not be kept damp or wet as this will cause blistering on the belly. A reptile water dish large enough for the snake to submerge in will provide plenty of humidity. In the winter time when indoor house humidity is long it may be important to partially cover screen tops to maintain moderate humidity.",
        "feeding_schedule": "Many keepers feed adults a frozen thawed rodent only diet, which is fine because this provides complete nutrition. However in the wild garters would eat a more varied live reptile food diet consisting of worms, amphibians, fish, and rodents, so it is a good idea to provide some variety in captivity. I prefer to feed both night crawlers and rodents, which can be found in pet stores or online reptile shops. Babies are easy to start on small cut up pieces of night crawlers. Most feeder fish contain an enzyme called thiaminase, which breaks down thiamine (vitamin B1). Long term exclusive feeding of these fish should be avoided, because doing so can lead to a potentially fatal vitamin deficiency. Garters DO NOT eat crickets, mealworms or other insects.",
        "known_problems": "Garter snakes are generally healthy and as long as their husbandry requirements are met and should thrive in captivity.",
        "other_information": "https://www.reptilesmagazine.com/garter-snake-care-sheet/",
        "other_information_name": "Reptiles Magazine"
    }
}, {
    "model": "care.care",
    "pk": 8,
    "fields": {
        "name": "Burmese Python",
        "category": 1,
        "animal": 8,
        "care_guide": "Burmese Pythons, because of their docile nature and undemanding requirements, are among the most suitable of the large snakes as captive animals. It’s been more than 35 years since I got my first Burmese, and the species still remains my favorite.\r\n\r\nThere’s no denying the popularity of the Burmese python. And as long as you’re sure you have the space to properly house one, you, too, should be able to discover why I still like them so much, after all these years. With proper snake supplies and reptile health and wellness in mind, this species is a great captive for dedicated keepers.",
        "cage_setup": "Most importantly, the cage should safely contain the snake. After all, subsequent requirements are less important once the snake has disappeared into that hole in the wall behind the washing machine because you forgot to properly secure it.\r\n\r\nThe size of the enclosure should be large enough to allow the snake a reasonable amount of movement, yet small enough to permit accurate temperature and humidity control. Burmese pythons are terrestrial snakes that spend most of their time on the ground, so the floor space of their enclosure will be more important to the animal than the height of the cage.\r\n\r\nA baby Burmese will require the space equivalent of a 10-gallon reptile terrariums. Larger individuals will need more space, of course. A 200-pound animal will need floor space measuring at least 4 feet by 8 feet. I recommend the enclosure have roughly the floor space equal to four to six times the area of the snake itself when it’s in a flat coil. The cage should also have a door that allows easy access and that can be closed securely. A glass or Plexiglas window for viewing is important, as well. Some ventilation is desirable, although not as much as one might initially think. Heat and humidity are easily lost through vents, especially through those on the top of the enclosure. Small vents located on the sides of the cage will permit adequate air exchange.\r\n\r\nWood, plastic and glass are all acceptable materials for cage construction. I use enclosures that are constructed of ABS plastic, and which have a smooth, nonporous finish that allows easy cleaning and sterilization.Snake habitat products may make this more difficult, so sometimes simplicity is the best option. All corners and edges are rounded, leaving no difficult-to-clean areas. The cages are lightweight, have large tempered glass viewing areas and, best of all, someone else has made them already. Regular and spot cleanings are required with proper reptile cleaning supplies.",
        "lighting": "A light cycle of 12 hours should be provided. No special UVB lighting is required.",
        "heating": "Burmese pythons prefer temperatures in the mid-80s Fahrenheit. Slightly cooler temperatures are allowable at night. Indeed, cooler night temperatures are essential to breeding Burmese pythons, should you desire to eventually undertake this endeavor.\r\n\r\nBecause Burmese pythons require temperatures above what we consider comfortable in our homes, it is necessary to raise the temperature of the enclosure with a supplemental heat source. This heat can be provided in several ways. I prefer to use a heat pad, such as the Zilla Heat Pad, or heat tape underneath the enclosure. Heat pads or undertank heaters are available in many pet shops that stock reptile supplies. They provide safe, even heating for smaller enclosures. Heat tape is also available and serves the same purpose, although it allows more flexibility in heating larger areas more economically. Various types of snake heat lamps are also available and effective, as well. There are many types of reptile heat lamps and fixtures you can choose from.\r\n\r\nIt is important, though, to give the snake some choice in determining its own temperature. In the wild, the animal would be able to thermoregulate by freely moving between warmer or cooler areas. These choices are limited in captivity, but by proper heater placement, it is possible to give the snake some control over its own temperature. You should have a hot side, and a cool side. The hot spot is species specific. The maximum thermal gradient can be obtained by placing the heater at one end of the enclosure rather than in the center. It will be warmer nearer the heater and cooler as the distance from the heater increases. This will give the snake a wider range of choices in regulating its own temperature.",
        "feeding_schedule": "Feeding Burmese pythons is fairly simple. I feed an appropriately sized meal whenever the snake is hungry. Baby Burmese pythons can eat an adult mouse during their first feeding, which is surprising to many novice snake keepers. Several sensory systems are operating in a feeding python. First, the food item must smell like something to eat. Second, the food item must move in the manner of a potential meal. And third, the food item must be warmer than its surroundings. Burmese pythons eat only warm-blooded prey and have sensory organs (pits) to detect the slight amount of heat generated by the body of a potential food item. A combination of these factors seems to be important in eliciting a feeding response in newborn pythons. Pinky mice normally do not move in a way that interests a baby python, and although I think they must smell like mice, they don’t generate and retain body heat very well.\r\n\r\nOnce a baby python has had its first few meals, it is possible for it to learn behaviors that allow it to recognize and eat prekilled food items, or even chicken parts or processed snake foods. It is sometimes recommended that snakes be fed only dead food items to avoid potential injury that could be inflicted by the struggling prey item. It is important to remember, though, that nearly every meal taken by a python in the history of the species has been living. Nature has prepared them well to deal with the possible associated problems. Frozen prekilled food makes things easier for us, though, and perhaps that should be the most important consideration.",
        "known_problems": "Snakes have only a limited ability to reason. Believe me, that statement is quite generous. Keepers can in advertently condition a snake to think (I’m being generous again) that every time the door to its cage opens it will be fed. If the snake is handled infrequently and most of its interaction with its keeper occurs during feeding time, this conditioning is reinforced. With large snakes, especially, it is important that the snake learn to differentiate feeding time from other times, and you from its dinner. It will make little difference to you what thought processes have led to your current situation as your snake’s mouth latches onto your forearm. What this means is that it’s a very good idea to be aware of your snake’s location and orientation when feeding or when servicing its cage. If a snake is acting hungry when I open the cage, I gently tap it on the nose with a rolled up newspaper. This is usually enough to let it know it’s not feeding time. It’s also best not to house more than one snake per cage, and it’s essential not to feed more than one snake in a cage at the same time.",
        "other_information": "https://www.reptilesmagazine.com/burmese-python-care-sheet/",
        "other_information_name": "Reptiles Magazine"
    }
}]